#### BuiltInFailures.DPartFailures Members

---

|  |
| --- |
| BuiltInFailures DPartFailures Class   Properties   See Also |

Provides a container of all Revit built-in FailureDefinitionId instances.

The  BuiltInFailures DPartFailures  type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property Static member | BindLinkWillDeleteAllPartsWarning | Bind Link will delete its associated Parts. |
| Public property Static member | DeletingDPartWillDeleteAllPartsWarning | Deleting a Part will delete all associated Parts and the original Element will be made visible. |
| Public property Static member | DeletingDPartWillDeleteMorePartsError | Deleting a Part will delete all associated Parts and the original Element will be made visible. |
| Public property Static member | DeletingOriginalWillDeleteParts | Deletion of this element will delete its associated Parts. |
| Public property Static member | DivideVolumesProfilesEdgeMatchForWidthAll | Division family cannot be used with the selected edge condition for all widths of hosts |
| Public property Static member | DivideVolumesProfilesEdgeMatchForWidthSome | Division family cannot be used with the selected edge condition for some widths of hosts |
| Public property Static member | DivideVolumesProfilesForWidthAll | Division family cannot be used for all widths of hosts |
| Public property Static member | DivideVolumesProfilesForWidthSome | Division family cannot be used for some widths of hosts |
| Public property Static member | DivideVolumesProfilesGapForWidthAll | Division family cannot be used with the selected division gap for all widths of hosts |
| Public property Static member | DivideVolumesProfilesGapForWidthSome | Division family cannot be used with the selected division gap for some widths of hosts |
| Public property Static member | DivideVolumesProfilesNonSlabSources | Some sources of a volume divider are non-slab like. |
| Public property Static member | DivideVolumesSketchesWithProfileUnfriendlyCurves | Sketch contains curves to which profiles cannot be applied or chains of curves. |
| Public property Static member | DivisionContainsNoParts | The division contains no parts. |
| Public property Static member | DivisionContainsNoReferences | The division contains no dividing references. |
| Public property Static member | ElementsAlreadyHaveParts | Some elements already have parts |
| Public property Static member | IneligibleElementsForParts | Creating parts from ineligible elements |
| Public property Static member | NoPartMakerCreatedInEditMode | Nothing will be divided. |
| Public property Static member | PartPhaseParametersConflictWithOriginal | The creation and demolition phases of a part must lie between the corresponding phases of the original. |
| Public property Static member | PartsCannotBeCreatedFromInvalidGeom | Post failure when attempts to create parts from invalid geometry. |
| Public property Static member | RemovingInvalidDPartParents | Can't make Parts out of these Elements. |
| Public property Static member | RemovingUndividedDPartParents | These parts are not intersected by any dividing references. They will be removed from the division. |
| Public property Static member | SourceInUnloadedLink | Some elements already have parts |

# See Also

BuiltInFailures DPartFailures Class

Autodesk.Revit.DB Namespace